ams/src/DataProcessors/AMS_Сводка/AMS_Сводка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_Сводка</name>
</mdclass:DataProcessor>

ams/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтролируемаяПартия</name>
    <type>
      <types>CatalogRef.КонтролируемыеПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ams/src/DataProcessors/AMS_Сводка/Forms/ФормаКОтгрузке/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//@skip-check unknown-form-parameter-access
	Заголовок = Параметры.Заголовок;

	Если Параметры.Резерв Тогда
		ПоказатьДокументыКОтгрузке();
	Иначе
		ПоказатьДокументыОжидаемыеКОтгрузке();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабл

&НаКлиенте
Процедура ТаблВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элемент.ТекущиеДанные.ДокументОтгрузки);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьДокументыКОтгрузке()
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",     Параметры.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",  Параметры.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Номенклатура",   Параметры.Номенклатура);
	Запрос.УстановитьПараметр("СкладПродукции", Параметры.Склад);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА т.ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
	|			ТОГДА т.ДокументОтгрузки.ДатаОтгрузки
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(т.ДокументОтгрузки.Дата, ДЕНЬ)
	|	КОНЕЦ КАК ДатаОтгрузки,
	|	т.ДокументОтгрузки КАК ДокументОтгрузки,
	|	т.Номенклатура КАК Номенклатура,
	|	(т.КОтгрузкеОстаток + т.ВРезервеОстаток) / т.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоличествоУпаковок,
	|	ТИПЗНАЧЕНИЯ(т.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента) КАК ЭтоЗаказКлиента
	|ПОМЕСТИТЬ КОтгр
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &СкладПродукции) КАК т
	|ГДЕ
	|	т.Номенклатура = &Номенклатура
	|	И (ТИПЗНАЧЕНИЯ(т.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента)
	|			ИЛИ ТИПЗНАЧЕНИЯ(т.ДокументОтгрузки) = ТИП(Документ.РеализацияТоваровУслуг))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.ДатаОтгрузки КАК ДатаОтгрузки,
	|	т.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ВЫБОР
	|		КОГДА т.ЭтоЗаказКлиента
	|			ТОГДА ""Заказ клиента""
	|		ИНАЧЕ т.ДокументОтгрузки.ХозяйственнаяОперация
	|	КОНЕЦ КАК Операция,
	|	т.ДокументОтгрузки.Партнер КАК Партнер,
	|	т.КоличествоУпаковок КАК КоличествоУпаковок,
	|	т.ДокументОтгрузки.СуммаДокумента КАК СуммаДокумента,
	|	т.ДокументОтгрузки.Менеджер КАК Менеджер,
	|	т.Номенклатура КАК Номенклатура,
	|	т.ЭтоЗаказКлиента КАК ЭтоЗаказКлиента
	|ИЗ
	|	КОтгр КАК т
	|ГДЕ
	|	т.ДатаОтгрузки МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Если Параметры.БезЗаказов Тогда
		Запрос.Текст = Запрос.Текст + "
	|	И НЕ т.ЭтоЗаказКлиента";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтгрузки";
	
	Табл.Загрузить(Запрос.Выполнить().Выгрузить());
	
	КоличествоУпаковок = Табл.Итог("КоличествоУпаковок");
КонецПроцедуры

&НаСервере
Процедура ПоказатьДокументыОжидаемыеКОтгрузке()
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",     Параметры.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",  Параметры.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Номенклатура",   Параметры.Номенклатура);
	Запрос.УстановитьПараметр("СкладПродукции", Параметры.Склад);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.ДатаОтгрузки КАК ДатаОтгрузки,
		|	""Заказ клиента"" КАК Операция,
		|	т.Количество / т.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоличествоУпаковок,
		|	д.Партнер КАК Партнер,
		|	д.СуммаДокумента КАК Сумма,
		|	д.Менеджер КАК Менеджер,
		|	т.Номенклатура КАК Номенклатура,
		|	д.Ссылка КАК ДокументОтгрузки
		|ИЗ
		|	Документ.ЗаказКлиента КАК д
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК т
		|		ПО д.Ссылка = т.Ссылка
		|ГДЕ
		|	д.Склад = &СкладПродукции
		|	И т.Номенклатура = &Номенклатура
		|	И т.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
		|	И д.Проведен
		|	И д.ДатаОтгрузки МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	д.Дата,
		|	д.ХозяйственнаяОперация,
		|	т.Количество / т.Номенклатура.КоэффициентЕдиницыДляОтчетов,
		|	д.Партнер,
		|	д.СуммаДокумента,
		|	д.Менеджер,
		|	т.Номенклатура,
		|	д.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК д
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК т
		|		ПО д.Ссылка = т.Ссылка
		|ГДЕ
		|	НЕ д.Проведен
		|	И НЕ д.ПометкаУдаления
		|	И д.Склад = &СкладПродукции
		|	И т.Номенклатура = &Номенклатура
		|	И д.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтгрузки";
	
	Табл.Загрузить(Запрос.Выполнить().Выгрузить());
	
	КоличествоУпаковок = Табл.Итог("КоличествоУпаковок");
КонецПроцедуры

#КонецОбласти
